sj15712795029/bluetooth_stack/board/stm32f10x/hw_wm8960.h
#define WM8960_VROI_20K ((uint16_t)(1 << 6))/* 1 = 20kΩVMID to output */
/* Anti-pop 1 Register Value(wm8960_reg_r28 = 0x1c) */
#define WM8960_HPSTBY_DISABLE ((uint16_t)(0 << 0)) /* 0 = Standby mode disabled (Normal operation) */
#define WM8960_HPSTBY_ENABLE ((uint16_t)(1 << 0))/* 1 = Standby mode enabled */
#define WM8960_SOFT_ST_DISABLE ((uint16_t)(0 << 2)) /* 0 = Disabled */
#define WM8960_SOFT_ST_ENABLE  ((uint16_t)(1 << 2)) /* 1 = Enabled */
#define WM8960_BUFIOEN_DISABLE ((uint16_t)(0 << 3)) /* 0 = Disabled */
#define WM8960_BUFIOEN_ENABLE  ((uint16_t)(1 << 3)) /* 1 = Enabled */
#define WM8960_BUFDCOPEN_DISABLE ((uint16_t)(0 << 4)) /* 0 = Disabled */
#define WM8960_BUFDCOPEN_ENABLE  ((uint16_t)(1 << 4)) /* 1 = Enabled */
#define WM8960_POBCTRL_0 ((uint16_t)(0 << 7)) /* 0 = VMID / R bias */
#define WM8960_POBCTRL_1  ((uint16_t)(1 << 7)) /* 1 = VGS / R bias */
/* Anti-pop 2 Register Value(wm8960_reg_r29 = 0x1d) */
#define WM8960_DRES_400 ((uint16_t)(0 << 4)) /* 400ms Resistance (Ohms) */
#define WM8960_DRES_200 ((uint16_t)(1 << 4))/* 200ms Resistance (Ohms) */
#define WM8960_DRES_600 ((uint16_t)(2 << 4))/* 600ms Resistance (Ohms) */
#define WM8960_DRES_150 ((uint16_t)(3 << 4))/* 150ms Resistance (Ohms) */
#define WM8960_DISOP_DISABLE ((uint16_t)(0 << 6)) /* 0 = Disabled */
#define WM8960_DISOP_ENABLE  ((uint16_t)(1 << 6)) /* 1 = Enabled */
/* ADCL signal path Register Value(wm8960_reg_r32 = 0x20) */
#define WM8960_LMIC2B_NC ((uint16_t)(0 << 3)) /* 0 = Not connected */
#define WM8960_LMIC2B_C ((uint16_t)(1 << 3))/* 1 = Connected  */
#define WM8960_LMICBOOST_0DB ((uint16_t)(0 << 4))/* 00 = +0dB */
#define WM8960_LMICBOOST_13DB ((uint16_t)(1 << 4))/* 01 = +13dB */
#define WM8960_LMICBOOST_20DB ((uint16_t)(2 << 4))/* 10 = +20dB  */
#define WM8960_LMICBOOST_29DB ((uint16_t)(3 << 4))/* 11 = +29dB */
#define WM8960_LMP2_NC ((uint16_t)(0 << 6))/* 0 = LINPUT2 not connected to PGA */
#define WM8960_LMP2_C ((uint16_t)(1 << 6))/* 1 = LINPUT2 connected to PGA (Constant input impedance)  */
#define WM8960_LMP3_NC ((uint16_t)(0 << 7))/* 0 = LINPUT3 not connected to PGA */
#define WM8960_LMP3_C ((uint16_t)(1 << 7))/* 1 = LINPUT3 connected to PGA (Constant input impedance)  */
#define WM8960_LMN1_NC ((uint16_t)(0 << 8))/* 0 = LINPUT1 not connected to PGA */
#define WM8960_LMN1_C ((uint16_t)(1 << 8))/* 1 = LINPUT1 connected to PGA */
/* ADCR signal path Register Value(wm8960_reg_r33 = 0x21) */
#define WM8960_RMIC2B_NC ((uint16_t)(0 << 3)) /* 0 = Not connected */
#define WM8960_RMIC2B_C ((uint16_t)(1 << 3))/* 1 = Connected  */
#define WM8960_RMICBOOST_0DB ((uint16_t)(0 << 4))/* 00 = +0dB */
#define WM8960_RMICBOOST_13DB ((uint16_t)(1 << 4))/* 01 = +13dB */
#define WM8960_RMICBOOST_20DB ((uint16_t)(2 << 4))/* 10 = +20dB  */
#define WM8960_RMICBOOST_29DB ((uint16_t)(3 << 4))/* 11 = +29dB */
#define WM8960_RMP2_NC ((uint16_t)(0 << 6))/* 0 = RINPUT2 not connected to PGA */
#define WM8960_RMP2_C ((uint16_t)(1 << 6))/* 1 = RINPUT2 connected to PGA (Constant input impedance)  */
#define WM8960_RMP3_NC ((uint16_t)(0 << 7))/* 0 = RINPUT3 not connected to PGA */
#define WM8960_RMP3_C ((uint16_t)(1 << 7))/* 1 = RINPUT3 connected to PGA (Constant input impedance)  */
#define WM8960_RMN1_NC ((uint16_t)(0 << 8))/* 0 = RINPUT1 not connected to PGA */
#define WM8960_RMN1_C ((uint16_t)(1 << 8))/* 1 = RINPUT1 connected to PGA */
/* Left out Mix (1) Register Value(wm8960_reg_r34 = 0x22) */
#define WM8960_LI2LOVOL_MIN ((uint16_t)(7 << 4)) /* LINPUT3 to Left Output Mixer Volume  */
#define WM8960_LI2LOVOL_MAX ((uint16_t)(0 << 4))/* 3dB progressive increase(range -21dB~0dB) */
#define WM8960_LI2LO_DISABLE ((uint16_t)(0 << 7)) /* 0 = Disable (Mute) */
#define WM8960_LI2LO_ENABLE ((uint16_t)(1 << 7)) /* 1 = Enable Path  */
#define WM8960_LD2LO_DISABLE ((uint16_t)(0 << 8)) /* 0 = Disable (Mute) */
#define WM8960_LD2LO_ENABLE ((uint16_t)(1 << 8)) /* 1 = Enable Path  */
/* Right out Mix (2) Register Value(wm8960_reg_r37 = 0x25) */
#define WM8960_RI2ROVO_MIN ((uint16_t)(7 << 4)) /* RINPUT3 to Right Output Mixer Volume  */
#define WM8960_RI2ROVO_MAX ((uint16_t)(0 << 4))/* 3dB progressive increase(range -21dB~0dB) */
#define WM8960_RI2RO_DISABLE ((uint16_t)(0 << 7)) /* 0 = Disable (Mute) */
#define WM8960_RI2RO_ENABLE ((uint16_t)(1 << 7)) /* 1 = Enable Path  */
#define WM8960_RD2RO_DISABLE ((uint16_t)(0 << 8)) /* 0 = Disable (Mute) */
#define WM8960_RD2RO_ENABLE ((uint16_t)(1 << 8)) /* 1 = Enable Path  */
/* Mono out Mix (1) Register Value(wm8960_reg_r38 = 0x26) */
#define WM8960_L2MO_DISABLE ((uint16_t)(0 << 7)) /* 0 = Left channel mix disabled */
#define WM8960_L2MO_ENABLE  ((uint16_t)(1 << 7)) /* 1 = Left channel mix enabled  */
/* Mono out Mix (2) Register Value(wm8960_reg_r39 = 0x27) */
#define WM8960_R2MO_DISABLE ((uint16_t)(0 << 7)) /* 0 = Right channel mix disabled */
#define WM8960_R2MO_ENABLE  ((uint16_t)(1 << 7)) /* 1 = Right channel mix enabled  */
/* LOUT2 volume Register Value(wm8960_reg_r40 = 0x28) */
#define WM8960_SPKLVOL_MIN ((uint16_t)(0x60 << 0)) /* SPK_LP/SPK_LN Volume */
#define WM8960_SPKLVOL_MAX ((uint16_t)(0x7f << 0)) /* 1dB progressive increase(range -73dB~+6dB) */
#define WM8960_SPKLZC_CZ ((uint16_t)(1 << 7)) /* 1 = Change gain on zero cross only */
#define WM8960_SPKLZC_CM ((uint16_t)(0 << 7)) /* 0 = Change gain immediately */
#define WM8960_SPKLVU_UPDATE  ((uint16_t)(1 << 8))/* Speaker Volume Update Writing a 1 to this bit will cause left and right speaker volumes to be updated (SPKLVOL and SPKRVOL)  */
/* ROUT2 volume Register Value(wm8960_reg_r41 = 0x29) */
#define WM8960_SPKRVOL_MIN ((uint16_t)(0x60 << 0)) /* SPK_LP/SPK_LN Volume */
#define WM8960_SPKRVOL_MAX ((uint16_t)(0x7f << 0)) /* 1dB progressive increase(range -73dB~+6dB) */
#define WM8960_SPKRZC_CZ ((uint16_t)(1 << 7)) /* 1 = Change gain on zero cross only */
#define WM8960_SPKRZC_CM ((uint16_t)(0 << 7)) /* 0 = Change gain immediately */
#define WM8960_SPKRVU_UPDATE  ((uint16_t)(1 << 8))/* Speaker Volume Update Writing a 1 to this bit will cause left and right speaker volumes to be updated (SPKLVOL and SPKRVOL)  */

/* MONOOUT volume Register Value(wm8960_reg_r42 = 0x2a) */
#define WM8960_MOUTVOL_0DB ((uint16_t)(0 << 6))/* 0 = 0dB */
#define WM8960_MOUTVOL_N1DB ((uint16_t)(1 << 6))/* 1 = -6dB  */
/* Input boost mixer (1) Register Value(wm8960_reg_r43 = 0x2b) */
#define WM8960_LIN2BOOST_MUTE ((uint16_t)(0 << 1))/* 000 = Mute */
#define WM8960_LIN2BOOST_MIN ((uint16_t)(1 << 1))/* LINPUT2 to Boost Mixer Gain */
#define WM8960_LIN2BOOST_MAX ((uint16_t)(7 << 1))/* 3dB progressive increase(range -12dB~+3dB) */
#define WM8960_LIN3BOOST_MUTE ((uint16_t)(0 << 4))/* 000 = Mute */
#define WM8960_LIN3BOOST_MIN ((uint16_t)(1 << 4))/* LINPUT3 to Boost Mixer Gain */
#define WM8960_LIN3BOOST_MAX ((uint16_t)(7 << 4))/* 3dB progressive increase(range -12dB~+3dB) */
/* Input boost mixer (2) Register Value(wm8960_reg_r44 = 0x2c) */
#define WM8960_RIN2BOOST_MUTE ((uint16_t)(0 << 1))/* 000 = Mute */
#define WM8960_RIN2BOOST_MIN ((uint16_t)(1 << 1))/* RINPUT2 to Boost Mixer Gain */
#define WM8960_RIN2BOOST_MAX ((uint16_t)(7 << 1))/* 3dB progressive increase(range -12dB~+3dB) */
#define WM8960_RIN3BOOST_MUTE ((uint16_t)(0 << 4))/* 000 = Mute */
#define WM8960_RIN3BOOST_MIN ((uint16_t)(1 << 4))/* RINPUT3 to Boost Mixer Gain */
#define WM8960_RIN3BOOST_MAX ((uint16_t)(7 << 4))/* 3dB progressive increase(range -12dB~+3dB) */
/* Bypass (1) Register Value(wm8960_reg_r45 = 0x2d) */
#define WM8960_LB2LOVOL_MIN ((uint16_t)(7 << 4)) /* Left Input Boost Mixer to Left Output Mixer Volume */
#define WM8960_LB2LOVOL_MAX ((uint16_t)(0 << 4))/* 3dB progressive increase(range -21dB~0dB) */
#define WM8960_LB2LO_DISABLE ((uint16_t)(0 << 7)) /* 0 = Disable (Mute)  */
#define WM8960_LB2LO_ENABLE  ((uint16_t)(1 << 7)) /* 1 = Enable Path */
/* Bypass (2) Register Value(wm8960_reg_r46 = 0x2e) */
#define WM8960_RB2ROVOL_MIN ((uint16_t)(7 << 4)) /* Right Input Boost Mixer to Left Output Mixer Volume */
#define WM8960_RB2ROVOL_MAX ((uint16_t)(0 << 4))/* 3dB progressive increase(range -21dB~0dB) */
#define WM8960_RB2RO_DISABLE ((uint16_t)(0 << 7)) /* 0 = Disable (Mute)  */
#define WM8960_RB2RO_ENABLE  ((uint16_t)(1 << 7)) /* 1 = Enable Path */
/* Pwr Mgmt (3) Register Value(wm8960_reg_r47 = 0x2f) */
#define WM8960_ROMIX_DISABLE ((uint16_t)(0 << 2))/* 0 = Disabled */
#define WM8960_ROMIX_ENABLE ((uint16_t)(1 << 2))/* 1 = Enabled */
#define WM8960_LOMIX_DISABLE ((uint16_t)(0 << 3))/* 0 = Disabled */
#define WM8960_LOMIX_ENABLE ((uint16_t)(1 << 3))/* 1 = Enabled */
#define WM8960_RMIC_DISABLE ((uint16_t)(0 << 4))/* 0 = PGA disabled  */
#define WM8960_RMIC_ENABLE ((uint16_t)(1 << 4))/* 1 = PGA enabled (if AINR = 1)  */
#define WM8960_LMIC_DISABLE ((uint16_t)(0 << 5))/* 0 = PGA disabled  */
#define WM8960_LMIC_ENABLE ((uint16_t)(1 << 5))/* 1 = PGA enabled (if AINR = 1)  */
/* Additional Control (4) Register Value(wm8960_reg_r48 = 0x30) */
#define WM8960_MBSE_0_9AVDD ((uint16_t)(0 << 2))/* 0 = 0.9 * AVDD */
#define WM8960_MBSE_0_65AVDD ((uint16_t)(1 << 2))/* 1 = 0.65 * AVDD */
#define WM8960_TSENSEN_DISABLE ((uint16_t)(0 << 1)) /* 0 = Temperature sensor disabled */
#define WM8960_TSENSEN_ENABLE ((uint16_t)(1 << 1)) /* 1 = Temperature sensor enabled  */
#define WM8960_HPSEL_GPIO1 ((uint16_t)(0 << 2))/* 0X = GPIO1 used for jack detect input (Requires ADCLRC pin to be configured as a GPIO)  */
#define WM8960_HPSEL_JD2 ((uint16_t)(2 << 2))/* 10 = JD2 used for jack detect input */
#define WM8960_HPSEL_JD3 ((uint16_t)(3 << 2))/* 11 = JD3 used for jack detect input  */
#define WM8960_GPIOSEL_0 ((uint16_t)(0 << 4))/* 000 = Jack detect input  */
#define WM8960_GPIOSEL_2 ((uint16_t)(2 << 4))/* 010 = Temperature ok */
#define WM8960_GPIOSEL_3 ((uint16_t)(3 << 4))/* 011 = Debounced jack detect output */
#define WM8960_GPIOSEL_4 ((uint16_t)(4 << 4))/* 100 = SYSCLK output */
#define WM8960_GPIOSEL_5 ((uint16_t)(5 << 4))/* 101 = PLL lock */
#define WM8960_GPIOSEL_6 ((uint16_t)(6 << 4))/* 110 = Logic 0 */
#define WM8960_GPIOSEL_7 ((uint16_t)(7 << 4))/* 111 = Logic 1 */
#define WM8960_GPIOPOL_NI ((uint16_t)(0 << 7)) /* 0 = Non inverted */
#define WM8960_GPIOPOL_I ((uint16_t)(1 << 7)) /* 1 = Inverted  */
/* Class D Control (1) Register Value(wm8960_reg_r49 = 0x31) */
#define WM8960_SPK_OP_EN_OFF ((uint16_t)(0 << 6)) /* 00 = Off */
#define WM8960_SPK_OP_EN_R ((uint16_t)(1 << 6))/* 01 = Left speaker only */
#define WM8960_SPK_OP_EN_L ((uint16_t)(2 << 6))/* 10 = Right speaker only */
#define WM8960_SPK_OP_EN_LR ((uint16_t)(3 << 6))/* 11 = Left and right speakers enabled  */
/* Class D Control (3) Register Value(wm8960_reg_r51 = 0x33) */
#define WM8960_ACGAIN_1_00 ((uint16_t)(0 << 0))/* 000 = 1.00x boost (+0dB) */
#define WM8960_ACGAIN_1_27 ((uint16_t)(1 << 0)) /* 001 = 1.27x boost (+2.1dB) */
#define WM8960_ACGAIN_1_40  ((uint16_t)2 << 0))/* 010 = 1.40x boost (+2.9dB)  */
#define WM8960_ACGAIN_1_52 ((uint16_t)(3 << 0)) /* 011 = 1.52x boost (+3.6dB) */
#define WM8960_ACGAIN_1_67  ((uint16_t)(4 << 0))/* 100 = 1.67x boost (+4.5dB) */
#define WM8960_ACGAIN_1_80  ((uint16_t)(5 << 0))/* 101 = 1.8x boost (+5.1dB) */
#define WM8960_DCGAIN_1_00 ((uint16_t)(0 << 3))/* 000 = 1.00x boost (+0dB) */
#define WM8960_DCGAIN_1_27 ((uint16_t)(1 << 3)) /* 001 = 1.27x boost (+2.1dB) */
#define WM8960_DCGAIN_1_40  ((uint16_t)2 << 3))/* 010 = 1.40x boost (+2.9dB)  */
#define WM8960_DCGAIN_1_52 ((uint16_t)(3 << 3)) /* 011 = 1.52x boost (+3.6dB) */
#define WM8960_DCGAIN_1_67  ((uint16_t)(4 << 3))/* 100 = 1.67x boost (+4.5dB) */
#define WM8960_DCGAIN_1_80  ((uint16_t)(5 << 3))/* 101 = 1.8x boost (+5.1dB) */
/* PLL N Register Value(wm8960_reg_r52 = 0x34) */
#define WM8960_PLLN_MIN ((uint16_t)(5 << 0))/* Integer (N) part of PLL input/output frequency ratio. Use values greater than 5 and less than 13. */
#define WM8960_PLLN_MAX ((uint16_t)(13 << 0))/* Integer (N) part of PLL input/output frequency ratio. Use values greater than 5 and less than 13. */
#define WM8960_PLLPRESCALE_1 ((uint16_t)(0 << 4)) /* 0 = Divide by 1 */
#define WM8960_PLLPRESCALE_2 ((uint16_t)(1 << 4)) /* 1 = Divide by 2  */
#define WM8960_SDM_IM ((uint16_t)(0 << 5)) /* 0 = Integer mode */
#define WM8960_SDM_FM ((uint16_t)(0 << 5)) /* 1 = Fractional mode */
#define WM8960_SYSCLK_1_0 ((uint16_t)(0 << 6)) /* 000 = SYSCLK  */
#define WM8960_SYSCLK_2_0 ((uint16_t)(1 << 6)) /* 001 = SYSCLK / 2  */
#define WM8960_SYSCLK_3_0 ((uint16_t)(2 << 6)) /* 010 = SYSCLK / 3 */
#define WM8960_SYSCLK_4_0 ((uint16_t)(3 << 6)) /* 011 = SYSCLK / 4 */
#define WM8960_SYSCLK_5_5 ((uint16_t)(4 << 6)) /* 100 = SYSCLK / 5.5 */
#define WM8960_SYSCLK_6_0 ((uint16_t)(5 << 6)) /* 101 = SYSCLK / 6  */
/* PLL K 1 Register Value(wm8960_reg_r53 = 0x35) */
/* PLL K 2 Register Value(wm8960_reg_r54 = 0x36) */
/* PLL K 3 Register Value(wm8960_reg_r55 = 0x37) */



