sj15712795029/bluetooth_stack/board/stm32f10x/hw_wm8960.h
typedef enum
{
    wm8960_reg_r0 = 0x00,   /* Left Input volume */
    wm8960_reg_r1 = 0x01,   /* Right Input volume */
    wm8960_reg_r2 = 0x02,   /* LOUT1 volume */
    wm8960_reg_r3 = 0x03,   /* ROUT1 volume */
    wm8960_reg_r4 = 0x04,   /* Clocking (1) */
    wm8960_reg_r5 = 0x05,   /* ADC & DAC Control (CTR1) */
    wm8960_reg_r6 = 0x06,   /* ADC & DAC Control (CTR2) */
    wm8960_reg_r7 = 0x07,   /* Audio Interface */
    wm8960_reg_r8 = 0x08,   /* Clocking (2) */
    wm8960_reg_r9 = 0x09,   /* Audio Interface */
    wm8960_reg_r10 = 0x0a,  /* Left DAC volume */
    wm8960_reg_r11 = 0x0b,  /* Right DAC volume */
    wm8960_reg_r12 = 0x0c,  /* Reserved */
    wm8960_reg_r13 = 0x0d,  /* Reserved */
    wm8960_reg_r14 = 0x0e,  /* Reserved */
    wm8960_reg_r15 = 0x0f,  /* Reset */
    wm8960_reg_r16 = 0x10,  /* 3D control */
    wm8960_reg_r17 = 0x11,  /* ALC1 */
    wm8960_reg_r18 = 0x12,  /* ALC2 */
    wm8960_reg_r19 = 0x13,  /* ALC3 */
    wm8960_reg_r20 = 0x14,  /* Noise Gate */
    wm8960_reg_r21 = 0x15,  /* Left ADC volume */
    wm8960_reg_r22 = 0x16,  /* Right ADC volume */
    wm8960_reg_r23 = 0x17,  /* Additional control(1) */
    wm8960_reg_r24 = 0x18,  /* Additional control(2) */
    wm8960_reg_r25 = 0x19,  /* Pwr Mgmt (1) */
    wm8960_reg_r26 = 0x1a,  /* Pwr Mgmt (2) */
    wm8960_reg_r27 = 0x1b,  /* Additional Control (3) */
    wm8960_reg_r28 = 0x1c,  /* Anti-pop 1 */
    wm8960_reg_r29 = 0x1d,  /* Anti-pop 2 */
    wm8960_reg_r30 = 0x1e,  /* Reserved */
    wm8960_reg_r31 = 0x1f,  /* Reserved */
    wm8960_reg_r32 = 0x20,  /* ADCL signal path  */
    wm8960_reg_r33 = 0x21,  /* ADCR signal path */
    wm8960_reg_r34 = 0x22,  /* Left out Mix (1) */
    wm8960_reg_r35 = 0x23,  /* Reserved */
    wm8960_reg_r36 = 0x24,  /* Reserved */
    wm8960_reg_r37 = 0x25,  /* Right out Mix (2) */
    wm8960_reg_r38 = 0x26,  /* Mono out Mix (1) */
    wm8960_reg_r39 = 0x27,  /* Mono out Mix (2) */
    wm8960_reg_r40 = 0x28,  /* LOUT2 volume */
    wm8960_reg_r41 = 0x29,  /* ROUT2 volume */
    wm8960_reg_r42 = 0x2a,  /* MONOOUT volume */
    wm8960_reg_r43 = 0x2b,  /* Input boost mixer (1) */
    wm8960_reg_r44 = 0x2c,  /* Input boost mixer (2) */
    wm8960_reg_r45 = 0x2d,  /* Bypass (1) */
    wm8960_reg_r46 = 0x2e,  /* Bypass (2) */
    wm8960_reg_r47 = 0x2f,  /* Pwr Mgmt (3) */
    wm8960_reg_r48 = 0x30,  /* Additional Control (4) */
    wm8960_reg_r49 = 0x31,  /* Class D Control (1) */
    wm8960_reg_r50 = 0x32,  /* Reserved */
    wm8960_reg_r51 = 0x33,  /* Class D Control (3) */
    wm8960_reg_r52 = 0x34,  /* PLL N */
    wm8960_reg_r53 = 0x35,  /* PLL K 1 */
    wm8960_reg_r54 = 0x36,  /* PLL K 2 */
    wm8960_reg_r55 = 0x37,  /* PLL K 3 */
} wm8960_reg_index_e;

/* wav header */
#define PLAYER_PACK_END	__attribute__ ((packed))

#define RIFF_CHUNK_ID 0x46464952
#define RIFF_CHUNK_FORMAT_WAV 0x45564157
#define FORMAT_CHUNK_ID 0x20746D66
#define DATA_CHUNK_ID 0x61746164



typedef struct
{
    uint32_t riff_chunk_id;		   	/* riff chunk id;这里固定为"RIFF",即0X46464952 */
    uint32_t riff_chunk_size ;		/* 集合大小;文件总大小-8 */
    uint32_t riff_format;	   		/* 格式;WAVE,即0X45564157 */

    uint32_t fmt_chunk_id;		   	/* format chunk id;这里固定为"fmt ",即0X20746D66 */
    uint32_t fmt_chunk_size ;		   	/* 子集合大小(不包括ID和Size);这里为:20.*/
    uint16_t fmt_audio_format;	  	/* 音频格式;0X01,表示线性PCM;0X11表示IMA ADPCM */
    uint16_t fmt_channel_number;		/* 通道数量;1,表示单声道;2,表示双声道; */
    uint32_t fmt_sample_rate;			/* 采样率;0X1F40,表示8Khz */
    uint32_t fmt_byte_rate;			/* 字节速率;sample_rate * channel_number * bits_per_sample / 8  */
    uint16_t fmt_block_align;			/* 块对齐(字节) channel_number * bits_per_sample / 8 */
    uint16_t fmt_bits_per_sample;		/* 单个采样数据大小 8：8bit，16：16bit，32：32bit */
    /* uint16_t fmt_byte_extra;		附加的数据字节;2个; 线性PCM,没有这个参数 */

    uint32_t data_chunk_id;		   	/* data chunk id;这里固定为"data",即0x61746164 */
    uint32_t data_chunk_size ;		   	/* 子集合大小(不包括ID和Size) */

} PLAYER_PACK_END wave_header_t;

typedef struct
{
    uint32_t sample_rate; /* 采样率;0X1F40,表示8Khz */
    uint16_t channel_number; /* 通道数量;1,表示单声道;2,表示双声道; */
    uint16_t block_align;	/* 块对齐(字节) channel_number * bits_per_sample / 8 */
    uint32_t data_size; /* wav的音频长度 */
    uint32_t totol_sec;/* 整个wav的长度(s) */
    uint32_t current_sec;/* 目前数据的定位(s) */
    uint32_t byte_rate;			/* 字节速率;sample_rate * channel_number * bits_per_sample / 8  */
    uint16_t bits_per_sample;		/* 单个采样数据大小 8：8bit，16：16bit，32：32bit */
	uint8_t *music_buffer1;
	uint32_t music_buffer1_len;
	uint8_t *music_buffer2;
	uint32_t music_buffer2_len;
	uint8_t current_play_buffer; /* 1->music_buffer1  2->music_buffer2 */
} wave_info_t;


uint8_t hw_wm8960_init(void);
uint8_t hw_wm8960_play_wav(uint8_t *path);
uint8_t wm8960_stop_play(void);

#endif
